In [2]:
# Importing dependencies
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
import pandas as pd
import tensorflow as tf

test_df = pd.read_csv('../Resources/test_clean.csv')
train_df = pd.read_csv('../Resources/train_clean.csv')
survivors_df = pd.read_csv('../Resources/gender_submission.csv')

display(test_df)
display(train_df)
display(survivors_df)

,PassengerId,Pclass,last_name,first_name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Deck
0,892,3,Kelly,Mr James,male,34.5,0,0,330911,7.8292,Q,"D,E,F,G"
1,893,3,Wilkes,Mrs James (Ellen Needs),female,47.0,1,0,363272,7.0000,S,"D,E,F,G"
2,894,2,Myles,Mr Thomas Francis,male,62.0,0,0,240276,9.6875,Q,"D,E,F,G"
3,895,3,Wirz,Mr Albert,male,27.0,0,0,315154,8.6625,S,"D,E,F,G"
4,896,3,Hirvonen,Mrs Alexander (Helga E Lindqvist),female,22.0,1,1,3101298,12.2875,S,"D,E,F,G"
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,Spector,Mr Woolf,male,23.0,0,0,A.5. 3236,8.0500,S,"D,E,F,G"
414,1306,1,Oliva y Ocana,Dona Fermina,female,39.0,0,0,PC 17758,108.9000,C,"A,B,C,D,E"
415,1307,3,Saether,Mr Simon Sivertsen,male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,S,"D,E,F,G"
416,1308,3,Ware,Mr Frederick,male,34.0,0,0,359309,8.0500,S,"D,E,F,G"
417,1309,3,Peter,Master Michael J,male,4.0,1,1,2668,22.3583,C,"D,E,F,G"

,PassengerId,Pclass,last_name,first_name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Deck
0,1,3,Braund,Mr Owen Harris,male,22.0,1,0,A/5 21171,7.2500,S,"D,E,F,G"
1,2,1,Cumings,Mrs John Bradley (Florence Briggs Thayer),female,38.0,1,0,PC 17599,71.2833,C,"A,B,C,D,E"
2,3,3,Heikkinen,Miss Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,S,"D,E,F,G"
3,4,1,Futrelle,Mrs Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,S,"A,B,C,D,E"
4,5,3,Allen,Mr William Henry,male,35.0,0,0,373450,8.0500,S,"D,E,F,G"
...,...,...,...,...,...,...,...,...,...,...,...,...
884,887,2,Montvila,Rev Juozas,male,27.0,0,0,211536,13.0000,S,"D,E,F,G"
885,888,1,Graham,Miss Margaret Edith,female,19.0,0,0,112053,30.0000,S,"A,B,C,D,E"
886,889,3,Johnston,Miss Catherine Helen Carrie,female,7.0,1,2,W./C. 6607,23.4500,S,"D,E,F,G"
887,890,1,Behr,Mr Karl Howell,male,26.0,0,0,111369,30.0000,C,"A,B,C,D,E"
888,891,3,Dooley,Mr Patrick,male,32.0,0,0,370376,7.7500,Q,"D,E,F,G"

     PassengerId  Survived
0            892         0
1            893         1
2            894         0
3            895         0
4            896         1
..           ...       ...
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [3]:
# Dropping non-beneficial ID columns
test_df_dropped = test_df.drop(['PassengerId', 'last_name', 'first_name'], axis=1)
train_df_dropped = train_df.drop(['PassengerId', 'last_name', 'first_name'], axis=1)

display(test_df_dropped)
display(train_df_dropped)

,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Deck
0,3,male,34.5,0,0,330911,7.8292,Q,"D,E,F,G"
1,3,female,47.0,1,0,363272,7.0000,S,"D,E,F,G"
2,2,male,62.0,0,0,240276,9.6875,Q,"D,E,F,G"
3,3,male,27.0,0,0,315154,8.6625,S,"D,E,F,G"
4,3,female,22.0,1,1,3101298,12.2875,S,"D,E,F,G"
...,...,...,...,...,...,...,...,...,...
413,3,male,23.0,0,0,A.5. 3236,8.0500,S,"D,E,F,G"
414,1,female,39.0,0,0,PC 17758,108.9000,C,"A,B,C,D,E"
415,3,male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,S,"D,E,F,G"
416,3,male,34.0,0,0,359309,8.0500,S,"D,E,F,G"
417,3,male,4.0,1,1,2668,22.3583,C,"D,E,F,G"

,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Deck
0,3,male,22.0,1,0,A/5 21171,7.2500,S,"D,E,F,G"
1,1,female,38.0,1,0,PC 17599,71.2833,C,"A,B,C,D,E"
2,3,female,26.0,0,0,STON/O2. 3101282,7.9250,S,"D,E,F,G"
3,1,female,35.0,1,0,113803,53.1000,S,"A,B,C,D,E"
4,3,male,35.0,0,0,373450,8.0500,S,"D,E,F,G"
...,...,...,...,...,...,...,...,...,...
884,2,male,27.0,0,0,211536,13.0000,S,"D,E,F,G"
885,1,female,19.0,0,0,112053,30.0000,S,"A,B,C,D,E"
886,3,female,7.0,1,2,W./C. 6607,23.4500,S,"D,E,F,G"
887,1,male,26.0,0,0,111369,30.0000,C,"A,B,C,D,E"
888,3,male,32.0,0,0,370376,7.7500,Q,"D,E,F,G"

In [7]:
# Looking at the number of unique values in each column for test_df
print(test_df_dropped.nunique())

Pclass        3
Sex           2
Age          80
SibSp         7
Parch         8
Ticket      363
Fare        169
Embarked      3
Deck          2
dtype: int64

In [8]:
# Looking at the number of unique values in each column for train_df
print(train_df_dropped.nunique())

Pclass        3
Sex           2
Age          89
SibSp         7
Parch         7
Ticket      679
Fare        248
Embarked      3
Deck          2
dtype: int64

In [17]:
train_df_dropped['Ticket'].value_counts()

Ticket
1601        7
CA. 2343    7
347082      7
CA 2144     6
347088      6
           ..
9234        1
19988       1
2693        1
PC 17612    1
370376      1
Name: count, Length: 679, dtype: int64

In [18]:
train_dummies_df = pd.get_dummies(train_df_dropped)
train_dummies_df

,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Ticket_110152,Ticket_110413,Ticket_110465,...,Ticket_W./C. 6608,Ticket_W./C. 6609,Ticket_W.E.P. 5734,Ticket_W/C 14208,Ticket_WE/P 5735,Embarked_C,Embarked_Q,Embarked_S,"Deck_A,B,C,D,E","Deck_D,E,F,G"
0,3,22.0,1,0,7.2500,False,True,False,False,False,...,False,False,False,False,False,False,False,True,False,True
1,1,38.0,1,0,71.2833,True,False,False,False,False,...,False,False,False,False,False,True,False,False,True,False
2,3,26.0,0,0,7.9250,True,False,False,False,False,...,False,False,False,False,False,False,False,True,False,True
3,1,35.0,1,0,53.1000,True,False,False,False,False,...,False,False,False,False,False,False,False,True,True,False
4,3,35.0,0,0,8.0500,False,True,False,False,False,...,False,False,False,False,False,False,False,True,False,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
884,2,27.0,0,0,13.0000,False,True,False,False,False,...,False,False,False,False,False,False,False,True,False,True
885,1,19.0,0,0,30.0000,True,False,False,False,False,...,False,False,False,False,False,False,False,True,True,False
886,3,7.0,1,2,23.4500,True,False,False,False,False,...,False,False,False,False,False,False,False,True,False,True
887,1,26.0,0,0,30.0000,False,True,False,False,False,...,False,False,False,False,False,True,False,False,True,False
888,3,32.0,0,0,7.7500,False,True,False,False,False,...,False,False,False,False,False,False,True,False,False,True

In [ ]:
# Spltting preprocessed data into features and target arrays
X = train_dummies_df
y = survivors_df['Survived']

In [19]:
survivors_df['PassengerId'].values

array([ 892,  893,  894,  895,  896,  897,  898,  899,  900,  901,  902,
        903,  904,  905,  906,  907,  908,  909,  910,  911,  912,  913,
        914,  915,  916,  917,  918,  919,  920,  921,  922,  923,  924,
        925,  926,  927,  928,  929,  930,  931,  932,  933,  934,  935,
        936,  937,  938,  939,  940,  941,  942,  943,  944,  945,  946,
        947,  948,  949,  950,  951,  952,  953,  954,  955,  956,  957,
        958,  959,  960,  961,  962,  963,  964,  965,  966,  967,  968,
        969,  970,  971,  972,  973,  974,  975,  976,  977,  978,  979,
        980,  981,  982,  983,  984,  985,  986,  987,  988,  989,  990,
        991,  992,  993,  994,  995,  996,  997,  998,  999, 1000, 1001,
       1002, 1003, 1004, 1005, 1006, 1007, 1008, 1009, 1010, 1011, 1012,
       1013, 1014, 1015, 1016, 1017, 1018, 1019, 1020, 1021, 1022, 1023,
       1024, 1025, 1026, 1027, 1028, 1029, 1030, 1031, 1032, 1033, 1034,
       1035, 1036, 1037, 1038, 1039, 1040, 1041, 1042, 1043, 1044, 1045,
       1046, 1047, 1048, 1049, 1050, 1051, 1052, 1053, 1054, 1055, 1056,
       1057, 1058, 1059, 1060, 1061, 1062, 1063, 1064, 1065, 1066, 1067,
       1068, 1069, 1070, 1071, 1072, 1073, 1074, 1075, 1076, 1077, 1078,
       1079, 1080, 1081, 1082, 1083, 1084, 1085, 1086, 1087, 1088, 1089,
       1090, 1091, 1092, 1093, 1094, 1095, 1096, 1097, 1098, 1099, 1100,
       1101, 1102, 1103, 1104, 1105, 1106, 1107, 1108, 1109, 1110, 1111,
       1112, 1113, 1114, 1115, 1116, 1117, 1118, 1119, 1120, 1121, 1122,
       1123, 1124, 1125, 1126, 1127, 1128, 1129, 1130, 1131, 1132, 1133,
       1134, 1135, 1136, 1137, 1138, 1139, 1140, 1141, 1142, 1143, 1144,
       1145, 1146, 1147, 1148, 1149, 1150, 1151, 1152, 1153, 1154, 1155,
       1156, 1157, 1158, 1159, 1160, 1161, 1162, 1163, 1164, 1165, 1166,
       1167, 1168, 1169, 1170, 1171, 1172, 1173, 1174, 1175, 1176, 1177,
       1178, 1179, 1180, 1181, 1182, 1183, 1184, 1185, 1186, 1187, 1188,
       1189, 1190, 1191, 1192, 1193, 1194, 1195, 1196, 1197, 1198, 1199,
       1200, 1201, 1202, 1203, 1204, 1205, 1206, 1207, 1208, 1209, 1210,
       1211, 1212, 1213, 1214, 1215, 1216, 1217, 1218, 1219, 1220, 1221,
       1222, 1223, 1224, 1225, 1226, 1227, 1228, 1229, 1230, 1231, 1232,
       1233, 1234, 1235, 1236, 1237, 1238, 1239, 1240, 1241, 1242, 1243,
       1244, 1245, 1246, 1247, 1248, 1249, 1250, 1251, 1252, 1253, 1254,
       1255, 1256, 1257, 1258, 1259, 1260, 1261, 1262, 1263, 1264, 1265,
       1266, 1267, 1268, 1269, 1270, 1271, 1272, 1273, 1274, 1275, 1276,
       1277, 1278, 1279, 1280, 1281, 1282, 1283, 1284, 1285, 1286, 1287,
       1288, 1289, 1290, 1291, 1292, 1293, 1294, 1295, 1296, 1297, 1298,
       1299, 1300, 1301, 1302, 1303, 1304, 1305, 1306, 1307, 1308, 1309],
      dtype=int64)